----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 24, 28, 28]             216
       BatchNorm2d-2           [-1, 24, 28, 28]              48
            Conv2d-3           [-1, 48, 28, 28]           1,152
       BatchNorm2d-4           [-1, 48, 28, 28]              96
            Conv2d-5           [-1, 12, 28, 28]           5,184
        Bottleneck-6           [-1, 36, 28, 28]               0
       BatchNorm2d-7           [-1, 36, 28, 28]              72
            Conv2d-8           [-1, 48, 28, 28]           1,728
       BatchNorm2d-9           [-1, 48, 28, 28]              96
           Conv2d-10           [-1, 12, 28, 28]           5,184
       Bottleneck-11           [-1, 48, 28, 28]               0
      BatchNorm2d-12           [-1, 48, 28, 28]              96
           Conv2d-13           [-1, 48, 28, 28]           2,304
      BatchNorm2d-14           [-1, 48, 28, 28]              96
           Conv2d-15           [-1, 12, 28, 28]           5,184
       Bottleneck-16           [-1, 60, 28, 28]               0
      BatchNorm2d-17           [-1, 60, 28, 28]             120
           Conv2d-18           [-1, 48, 28, 28]           2,880
      BatchNorm2d-19           [-1, 48, 28, 28]              96
           Conv2d-20           [-1, 12, 28, 28]           5,184
       Bottleneck-21           [-1, 72, 28, 28]               0
      BatchNorm2d-22           [-1, 72, 28, 28]             144
           Conv2d-23           [-1, 48, 28, 28]           3,456
      BatchNorm2d-24           [-1, 48, 28, 28]              96
           Conv2d-25           [-1, 12, 28, 28]           5,184
       Bottleneck-26           [-1, 84, 28, 28]               0
      BatchNorm2d-27           [-1, 84, 28, 28]             168
           Conv2d-28           [-1, 48, 28, 28]           4,032
      BatchNorm2d-29           [-1, 48, 28, 28]              96
           Conv2d-30           [-1, 12, 28, 28]           5,184
       Bottleneck-31           [-1, 96, 28, 28]               0
      BatchNorm2d-32           [-1, 96, 28, 28]             192
           Conv2d-33           [-1, 48, 28, 28]           4,608
       Transition-34           [-1, 48, 14, 14]               0
      BatchNorm2d-35           [-1, 48, 14, 14]              96
           Conv2d-36           [-1, 48, 14, 14]           2,304
      BatchNorm2d-37           [-1, 48, 14, 14]              96
           Conv2d-38           [-1, 12, 14, 14]           5,184
       Bottleneck-39           [-1, 60, 14, 14]               0
      BatchNorm2d-40           [-1, 60, 14, 14]             120
           Conv2d-41           [-1, 48, 14, 14]           2,880
      BatchNorm2d-42           [-1, 48, 14, 14]              96
           Conv2d-43           [-1, 12, 14, 14]           5,184
       Bottleneck-44           [-1, 72, 14, 14]               0
      BatchNorm2d-45           [-1, 72, 14, 14]             144
           Conv2d-46           [-1, 48, 14, 14]           3,456
      BatchNorm2d-47           [-1, 48, 14, 14]              96
           Conv2d-48           [-1, 12, 14, 14]           5,184
       Bottleneck-49           [-1, 84, 14, 14]               0
      BatchNorm2d-50           [-1, 84, 14, 14]             168
           Conv2d-51           [-1, 48, 14, 14]           4,032
      BatchNorm2d-52           [-1, 48, 14, 14]              96
           Conv2d-53           [-1, 12, 14, 14]           5,184
       Bottleneck-54           [-1, 96, 14, 14]               0
      BatchNorm2d-55           [-1, 96, 14, 14]             192
           Conv2d-56           [-1, 48, 14, 14]           4,608
      BatchNorm2d-57           [-1, 48, 14, 14]              96
           Conv2d-58           [-1, 12, 14, 14]           5,184
       Bottleneck-59          [-1, 108, 14, 14]               0
      BatchNorm2d-60          [-1, 108, 14, 14]             216
           Conv2d-61           [-1, 48, 14, 14]           5,184
      BatchNorm2d-62           [-1, 48, 14, 14]              96
           Conv2d-63           [-1, 12, 14, 14]           5,184
       Bottleneck-64          [-1, 120, 14, 14]               0
      BatchNorm2d-65          [-1, 120, 14, 14]             240
           Conv2d-66           [-1, 60, 14, 14]           7,200
       Transition-67             [-1, 60, 7, 7]               0
      BatchNorm2d-68             [-1, 60, 7, 7]             120
           Conv2d-69             [-1, 48, 7, 7]           2,880
      BatchNorm2d-70             [-1, 48, 7, 7]              96
           Conv2d-71             [-1, 12, 7, 7]           5,184
       Bottleneck-72             [-1, 72, 7, 7]               0
      BatchNorm2d-73             [-1, 72, 7, 7]             144
           Conv2d-74             [-1, 48, 7, 7]           3,456
      BatchNorm2d-75             [-1, 48, 7, 7]              96
           Conv2d-76             [-1, 12, 7, 7]           5,184
       Bottleneck-77             [-1, 84, 7, 7]               0
      BatchNorm2d-78             [-1, 84, 7, 7]             168
           Conv2d-79             [-1, 48, 7, 7]           4,032
      BatchNorm2d-80             [-1, 48, 7, 7]              96
           Conv2d-81             [-1, 12, 7, 7]           5,184
       Bottleneck-82             [-1, 96, 7, 7]               0
      BatchNorm2d-83             [-1, 96, 7, 7]             192
           Conv2d-84             [-1, 48, 7, 7]           4,608
      BatchNorm2d-85             [-1, 48, 7, 7]              96
           Conv2d-86             [-1, 12, 7, 7]           5,184
       Bottleneck-87            [-1, 108, 7, 7]               0
      BatchNorm2d-88            [-1, 108, 7, 7]             216
           Conv2d-89             [-1, 48, 7, 7]           5,184
      BatchNorm2d-90             [-1, 48, 7, 7]              96
           Conv2d-91             [-1, 12, 7, 7]           5,184
       Bottleneck-92            [-1, 120, 7, 7]               0
      BatchNorm2d-93            [-1, 120, 7, 7]             240
           Conv2d-94             [-1, 48, 7, 7]           5,760
      BatchNorm2d-95             [-1, 48, 7, 7]              96
           Conv2d-96             [-1, 12, 7, 7]           5,184
       Bottleneck-97            [-1, 132, 7, 7]               0
      BatchNorm2d-98            [-1, 132, 7, 7]             264
           Linear-99                   [-1, 10]           1,330
================================================================
Total params: 175,690
Trainable params: 175,690
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 12.75
Params size (MB): 0.67
Estimated Total Size (MB): 13.42
----------------------------------------------------------------
